mtx1228/lyx_code/FreeRTOS学习历程-FreeRTOS Kernel V10.4.4/22-任务通知-轻量级事件组的实现/FreeRTOS/Demo/CORTEX_STM32F103_Keil/main.c
/*
 * FreeRTOS V202107.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

/*
 * Creates all the demo application tasks, then starts the scheduler.  The WEB
 * documentation provides more details of the standard demo application tasks.
 * In addition to the standard demo tasks, the following tasks and tests are
 * defined and/or created within this file:
 *
 * "Fast Interrupt Test" - A high frequency periodic interrupt is generated
 * using a free running timer to demonstrate the use of the
 * configKERNEL_INTERRUPT_PRIORITY configuration constant.  The interrupt
 * service routine measures the number of processor clocks that occur between
 * each interrupt - and in so doing measures the jitter in the interrupt timing.
 * The maximum measured jitter time is latched in the ulMaxJitter variable, and
 * displayed on the LCD by the 'Check' task as described below.  The
 * fast interrupt is configured and handled in the timertest.c source file.
 *
 * "LCD" task - the LCD task is a 'gatekeeper' task.  It is the only task that
 * is permitted to access the display directly.  Other tasks wishing to write a
 * message to the LCD send the message on a queue to the LCD task instead of
 * accessing the LCD themselves.  The LCD task just blocks on the queue waiting
 * for messages - waking and displaying the messages as they arrive.
 *
 * "Check" task -  This only executes every five seconds but has the highest
 * priority so is guaranteed to get processor time.  Its main function is to
 * check that all the standard demo tasks are still operational.  Should any
 * unexpected behaviour within a demo task be discovered the 'check' task will
 * write an error to the LCD (via the LCD task).  If all the demo tasks are
 * executing with their expected behaviour then the check task writes PASS
 * along with the max jitter time to the LCD (again via the LCD task), as
 * described above.
 *
 */

/* Standard includes. */
#include <stdio.h>

/* Scheduler includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "event_groups.h"



/* Library includes. */
#include "stm32f10x_it.h"

/* Demo app includes. */
#include "lcd.h"
#include "LCD_Message.h"
#include "BlockQ.h"
#include "death.h"
#include "integer.h"
#include "blocktim.h"
#include "partest.h"
#include "semtest.h"
#include "PollQ.h"
#include "flash.h"
#include "comtest2.h"

#include "serial.h"


/*-----------------------------------------------------------*/

/*
 * Configure the clocks, GPIO and other peripherals as required by the demo.
 */
static void prvSetupHardware(void);

/*
 * Retargets the C library printf function to the USART.
 */
int fputc(int ch, FILE *f);

/*
 * Configures the timers and interrupts for the fast interrupt test as
 * described at the top of this file.
 */
extern void vSetupTimerTest(void);

/*-----------------------------------------------------------*/
static long sum = 0;

static long dec = 0;

/***
 * 使用volatile时，修改变量i时，要读、修改、写内存
 * 不使用volatile的话，修改变量i时可能会优化，比如把它的值放在CPU寄存器中，累加时不涉及内存，这样速度会加快
 * 要访问硬件寄存器的话，要加上volatile避免被优化
 * volatile的含义是		易变的，这是提醒编译器，不要轻易优化我
 */
//volatile int i; /*让系统不再优化此变量*/

static volatile int flagCalcEnd = 0; /*task1计算结束 为1*/

static volatile int flagUARTUsed = 0; /*串口是否使用*/

static QueueHandle_t xQueueCalHandle; /*队列的句柄*/

static EventGroupHandle_t xEventGroupHandleTest; /*事件组的句柄 */

static TaskHandle_t xHandleTask3; // 任务句柄 以后使用它来操作这个任务3


void Task1Function(void *param)
{
	volatile int i; /*让系统不再优化此变量*/

	while (1)
	{
		for (i = 0; i < 100000; i++) /*累加*/
		{
			sum++;
		}
		/*计算完成 向队列中写入数据*/
		xQueueSend(xQueueCalHandle, &sum, 0); /* 无法写入数据时会立马返回 */

		/*计算完成 设置事件bit0*/
		//xEventGroupSetBits(xEventGroupHandleTest, (1<<0)); /* 设置事件组的bit0*/

		/**当第三个参数eNotifyAction被  ，设置为eSetBits
		* 第二个参数，可以设置通知值的位，达到和事件组相似的功能
		* 当写入(1<<0) ，其通知值将会是 通知值 = 通知值|(1<<0)
		*/
		xTaskNotify(xHandleTask3, (1<<0), eSetBits);/*使用任务通知来设置通知值的第0位*/
		printf("Task1 set bit0\r\n");
		vTaskDelete(NULL);
	}
}

void Task2Function(void *param)/*累减*/
{
	volatile int i; /*让系统不再优化此变量*/

	while (1)
	{
		for (i = 0; i < 1000000; i++)
		{
			dec--;
		}
		/*计算完成 向队列中写入数据*/
		xQueueSend(xQueueCalHandle, &dec, 0); /* 无法写入数据时会立马返回 */


		/*计算完成 设置事件的bit1*/	
		//xEventGroupSetBits(xEventGroupHandleTest, (1<<1)); /* 设置事件组的bit1*/

		
		/**当第三个参数eNotifyAction被  ，设置为eSetBits
		* 第二个参数，可以设置通知值的位，达到和事件组相似的功能
		* 当写入(1<<0) ，其通知值将会是 通知值 = 通知值|(1<<0)
		*/
		xTaskNotify(xHandleTask3, (1<<1), eSetBits);/*使用任务通知来设置通知值的第1位*/
		printf("Task2 set bit1\r\n");
		vTaskDelete(NULL);/*自杀 让其他task得以运行*/
	}
}


void Task3Function(void *param)
{
	int value1,value2; /*读取队列的buff缓冲区*/
	int bits;
	while (1)
	{
		/* 等待事件 */
		/***
		* 等待事件组的某一位发生
		* 第二个参数是等待哪几位
		* 第三个参数是 等待设置成bit后，结束后是否清除此bit位
		* 第四个参数是 是否等待所有bit都发生     ， 还是这两个事件中的任意一个
		* 事件组的bit位未设置  ，就一直等待， 阻塞
		*/
		//xEventGroupWaitBits(xEventGroupHandleTest, (1<<0)|(1<<1), pdTRUE, pdTRUE, portMAX_DELAY);

		xTaskNotifyWait(0, 0, &bits, portMAX_DELAY);
		if((bits & 0x3) == 0x3)/*当两位都被设置成1*/
		{
			vTaskDelay(20);/*监测到事件组的bit设置之后，延时从队列中获得数据，然后打印*/


			/* 等待到数据之后，将这个值读出来*/
			xQueueReceive(xQueueCalHandle, &value1, 0);
			
			xQueueReceive(xQueueCalHandle, &value2, 0);

			printf("value1 = %d, value2 = %d\r\n", value1,value2);
			
		}
		else/*当只有1位被设置成1或者其他情况*/
		{		
			vTaskDelay(20);/*监测到事件组的bit设置之后，延时从队列中获得数据，然后打印*/
			printf("Have not get all bits, get only 0x%x\r\n",bits);
		}
	}
}



void Task4Function(void *param) /*点灯的task4*/
{
	GPIO_InitTypeDef GPIO_InitStruct;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_13;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStruct);

	while (1)
	{
		GPIO_WriteBit(GPIOC, GPIO_Pin_13, Bit_RESET);
		vTaskDelay(100);
		GPIO_WriteBit(GPIOC, GPIO_Pin_13, Bit_SET);
		vTaskDelay(100);
	}
}
/*-----------------------------------------------------------*/

int main(void)
{
	TaskHandle_t xHandleTask1; // 任务句柄 以后使用它来操作这个任务

#ifdef DEBUG
	debug();
#endif

	prvSetupHardware(); // 硬件设置

	printf("Hello,World!\r\n");

	/* 创建事件组 */
	xEventGroupHandleTest = xEventGroupCreate();

	/*创建Queue*/
	/*其中2表示队列的长度，sizeof(int)表示队列中数据的大小*/
	xQueueCalHandle = xQueueCreate(2, sizeof(int));
	if (xQueueCalHandle == NULL)
		printf("can not create the Queue!\r\n");

	/*动态分配task*/
	xTaskCreate(Task1Function, "task1", 100, NULL, 1, &xHandleTask1); // 任务1 打印1
	xTaskCreate(Task2Function, "task2", 100, NULL, 1, NULL);		  // 任务2 打印2
	xTaskCreate(Task3Function, "task3", 100, NULL, 1, &xHandleTask3);		  // 任务2 打印2



	/* Start the scheduler. */
	vTaskStartScheduler(); // 设置周期

	/* Will only get here if there was not enough heap space to create the
	idle task. */
	return 0;
}
/*-----------------------------------------------------------*/

/*-----------------------------------------------------------*/

/*-----------------------------------------------------------*/

static void prvSetupHardware(void)
{
	/* Start with the clocks in their expected state. */
	RCC_DeInit();

	/* Enable HSE (high speed external clock). */
	RCC_HSEConfig(RCC_HSE_ON);

	/* Wait till HSE is ready. */
	while (RCC_GetFlagStatus(RCC_FLAG_HSERDY) == RESET)
	{
	}

	/* 2 wait states required on the flash. */
	*((unsigned long *)0x40022000) = 0x02;

	/* HCLK = SYSCLK */
	RCC_HCLKConfig(RCC_SYSCLK_Div1);

	/* PCLK2 = HCLK */
	RCC_PCLK2Config(RCC_HCLK_Div1);

	/* PCLK1 = HCLK/2 */
	RCC_PCLK1Config(RCC_HCLK_Div2);

	/* PLLCLK = 8MHz * 9 = 72 MHz. */
	RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_9);

	/* Enable PLL. */
	RCC_PLLCmd(ENABLE);

	/* Wait till PLL is ready. */
	while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET)
	{
	}

	/* Select PLL as system clock source. */
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);

	/* Wait till PLL is used as system clock source. */
	while (RCC_GetSYSCLKSource() != 0x08)
	{
	}

	/* Enable GPIOA, GPIOB, GPIOC, GPIOD, GPIOE and AFIO clocks */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE | RCC_APB2Periph_AFIO, ENABLE);

	/* SPI2 Periph clock enable */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);

	/* Set the Vector Table base address at 0x08000000 */
	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);

	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

	/* Configure HCLK clock as SysTick clock source. */
	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK);

	SerialPortInit();
}
/*-----------------------------------------------------------*/

/*-----------------------------------------------------------*/

/*-----------------------------------------------------------*/

#ifdef DEBUG
/* Keep the linker happy. */
void assert_failed(unsigned char *pcFile, unsigned long ulLine)
{
	for (;;)
	{
	}
}
#endif
